# Варіант 28
# Отримати всі піфагорові трійки натуральних чисел, кожне з яких не перевищує n, тобто всі такі
# трійки натуральних чисел a, b, c, що a^2 + b^2 = c^2 (a<=n, b<=n, c<=n).
import math
import time
n = int(input("Enter natural number n: "))  # Введення натурального числа n
for a in range(1, n+1):  # Цикл для числа a, де ітерація йде від 1 до n включно
    for b in range(a+1, n+1):  # Вкладений цикл для числа b, де ітерація йде від a+1 до n включно
        c = math.sqrt(a ** 2 + b ** 2)
        if c == int(c) and c <= n:  # Якщо a^2 + b^2 = c^2, тобто корінь з a^2 + b^2 э цілим числом,
            # то виведемо ці значення
            c = int(c)
            print(f'a = {a}, b = {b}, c= {c}')