/*Варіант 28
Отримати всі піфагорові трійки натуральних чисел, кожне з яких не перевищує n, тобто всі такі
трійки натуральних чисел a, b, c, що a^2 + b^2 = c^2 (a<=n, b<=n, c<=n). */
#include <iostream>
using namespace std;
#include <cmath>
int main() {
    int n;
    double c;
    cout << "Enter natural number n: ";
    cin >> n; // Введення натурального числа n
    for(int a = 1; a <= n; a++) // Цикл для числа a, де ітерація йде від 1 до n включно
    {
        for(int b = a + 1; b <= n; b++) // Вкладений цикл для числа b, де ітерація йде від a+1 до n включно
        {
            c = sqrt(a * a + b * b);
            if(c == int(c) && (c <= n))
            {
                cout << "a = " << a << " b = " << b << " c = " << c << "\n"; /* Якщо a^2 + b^2 = c^2,
                тобто корінь з a^2 + b^2 э цілим числом, то виведемо ці значення */
            }
        }
    }
    return 0;
}
