# Варіант 28
# Знайти суму цифр заданого натурального числа n.

n = int(input("Enter natural number n: "))  # Введення наутрального числа
temp_num = n  # Змінна для визначення розряду заданного числа
count = 1  # Розядність числа(для натурального числа мінімальна розрядність - 1)
while temp_num >= 10:  # Виконуємо цілочисельне ділення на 10, допоки число >= 10
    temp_num = temp_num // 10
    count += 1  # Кількість разів цілочисельного ділення числа на 10 дорівнює розряду числа,
    # тому  при кожному такому діленні збільшуємо змінну для розрядності на 1.
sum_digits = 0  # Ініціалізація змінної для суми цифр
for i in range(count, 0, -1):  # Цикл, в якому ітерація йде від номеру числа розрядності до 0 невключно
    digit = n // (10 ** (i -1))  # Обчислення i-ї цифри числа, якщо рахувати справа
    sum_digits += digit  # Додавання до суми цифр отриману цифру
    n = n % (10 ** (i - 1))  # Задане число без цифр, сума яких вже порахована
print(f"Sum of digits = {sum_digits}")  # Виведення суми цифр заданого натурального числа


